[
  {
    "Id": "0",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "List specific extensions that users can NOT install in Microsoft Edge. When you deploy this policy, any extensions on this list that were previously installed will be disabled, and the user won\u0027t be able to enable them. If you remove an item from the list of blocked extensions, that extension is automatically re-enabled anywhere it was previously installed.\r\n\r\nUse \"*\" to block all extensions that aren\u0027t explicitly listed in the allow list.\r\n\r\nIf you don\u0027t configure this policy, users can install any extension in Microsoft Edge.\r\n\r\nExample value:\r\n\r\nextension_id1\r\nextension_id2",
        "DisplayName": "Control which extensions cannot be installed",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "ExtensionInstallBlocklist",
          "Control which extensions cannot be installed",
          "\\Microsoft Edge\\Extensions",
          "Microsoft Edge\\Extensions",
          "Extensions"
        ],
        "Name": "ExtensionInstallBlocklist",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Extensions/ExtensionInstallBlocklist",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "",
        "Description": "",
        "DisplayName": "Extension IDs the user should be prevented from installing (or * for all) (Device)",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "ExtensionInstallBlocklist",
          "Control which extensions cannot be installed",
          "\\Microsoft Edge\\Extensions",
          "Microsoft Edge\\Extensions",
          "Extensions"
        ],
        "Name": "ExtensionInstallBlocklistDesc",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Extensions/ExtensionInstallBlocklist",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "2a951e8f-db16-4124-90a8-445e0a38a427"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "1",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "If you enable this policy or leave it unset, Basic authentication challenges received over non-secure HTTP will be allowed.\r\n\r\nIf you disable this policy,  non-secure HTTP requests from the Basic authentication scheme are blocked, and only secure HTTPS is allowed.\r\n\r\nThis policy setting is ignored (and Basic is always forbidden) if the \u0027AuthSchemes\u0027 (Supported authentication schemes) policy is set and does not include Basic.",
        "DisplayName": "Allow Basic authentication for HTTP",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "BasicAuthOverHttpEnabled",
          "Allow Basic authentication for HTTP",
          "\\Microsoft Edge\\HTTP authentication",
          "Microsoft Edge\\HTTP authentication",
          "HTTP authentication"
        ],
        "Name": "BasicAuthOverHttpEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev88.0.705.23~Policy~microsoft_edge~HTTPAuthentication/BasicAuthOverHttpEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "0731cb20-670c-4098-828c-4e4fcd6a6564"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "2",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "Specifies which HTTP authentication schemes are supported.\r\n\r\nYou can configure the policy by using these values: \u0027basic\u0027, \u0027digest\u0027, \u0027ntlm\u0027, and \u0027negotiate\u0027. Separate multiple values with commas.\r\n\r\nIf you don\u0027t configure this policy, all four schemes are used.\r\n\r\nExample value: basic,digest,ntlm,negotiate",
        "DisplayName": "Supported authentication schemes",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "AuthSchemes",
          "Supported authentication schemes",
          "\\Microsoft Edge\\HTTP authentication",
          "Microsoft Edge\\HTTP authentication",
          "HTTP authentication"
        ],
        "Name": "AuthSchemes",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~HTTPAuthentication/AuthSchemes",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "",
        "Description": "",
        "DisplayName": "Supported authentication schemes (Device)",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "AuthSchemes",
          "Supported authentication schemes",
          "\\Microsoft Edge\\HTTP authentication",
          "Microsoft Edge\\HTTP authentication",
          "HTTP authentication"
        ],
        "Name": "AuthSchemes",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~HTTPAuthentication/AuthSchemes",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "ff2dc16a-351f-4951-8797-7e2c7c9aac8d"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "3",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Enables user-level installation of native messaging hosts.\r\n\r\nIf you disable this policy, Microsoft Edge will only use native messaging hosts installed on the system level.\r\n\r\nBy default, if you don\u0027t configure this policy, Microsoft Edge will allow usage of user-level native messaging hosts.",
        "DisplayName": "Allow user-level native messaging hosts (installed without admin permissions)",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "NativeMessagingUserLevelHosts",
          "Allow user-level native messaging hosts (installed without admin permissions)",
          "\\Microsoft Edge\\Native Messaging",
          "Microsoft Edge\\Native Messaging",
          "Native Messaging"
        ],
        "Name": "NativeMessagingUserLevelHosts",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~NativeMessaging/NativeMessagingUserLevelHosts",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "1e9bfcff-625a-4a1f-8953-afc350005704"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "4",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Controls whether insecure websites are allowed to make requests to more-private network endpoints.\r\n\r\nThis policy relates to the CORS-RFC1918 specification. See https://wicg.github.io/cors-rfc1918 for more details.\r\n\r\nA network endpoint is more private than another if:\r\n1) Its IP address is localhost and the other is not.\r\n2) Its IP address is private and the other is public.\r\nIn the future, depending on spec evolution, this policy might apply to all cross-origin requests directed at private IPs or localhost.\r\n\r\nA website is deemed secure if it meets the definition of a secure context in https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts. Otherwise, it will be treated as an insecure context.\r\n\r\nWhen this policy is either not set or set to false, the default behavior for requests from insecure contexts to more-private network endpoints will depend on the user\u0027s personal configuration for the BlockInsecurePrivateNetworkRequests feature, which may be set by a field trial or on the command line.\r\n\r\nWhen this policy is set to true, insecure websites are allowed to make requests to any network endpoint, subject to other cross-origin checks.",
        "DisplayName": "Specifies whether to allow insecure websites to make requests to more-private network endpoints",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "InsecurePrivateNetworkRequestsAllowed",
          "Specifies whether to allow insecure websites to make requests to more-private network endpoints",
          "\\Microsoft Edge\\Private Network Request Settings",
          "Microsoft Edge\\Private Network Request Settings",
          "Private Network Request Settings"
        ],
        "Name": "InsecurePrivateNetworkRequestsAllowed",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev92~Policy~microsoft_edge~PrivateNetworkRequestSettings/InsecurePrivateNetworkRequestsAllowed",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "c6dec9f2-a235-4878-8462-e88569b47e0b"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "5",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy setting lets you configure whether to turn on Microsoft Defender SmartScreen. Microsoft Defender SmartScreen provides warning messages to help protect your users from potential phishing scams and malicious software. By default, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you enable this setting, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you disable this setting, Microsoft Defender SmartScreen is turned off.\r\n\r\nIf you don\u0027t configure this setting, users can choose whether to use Microsoft Defender SmartScreen.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
        "DisplayName": "Configure Microsoft Defender SmartScreen",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "SmartScreenEnabled",
          "Configure Microsoft Defender SmartScreen",
          "\\Microsoft Edge\\SmartScreen settings",
          "Microsoft Edge\\SmartScreen settings",
          "SmartScreen settings"
        ],
        "Name": "SmartScreenEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/SmartScreenEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "413019e3-9d1f-412d-9902-1dcd01b2ea80"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "6",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy setting lets you configure whether to turn on blocking for potentially unwanted apps with Microsoft Defender SmartScreen. Potentially unwanted app blocking with Microsoft Defender SmartScreen provides warning messages to help protect users from adware, coin miners, bundleware, and other low-reputation apps that are hosted by websites. Potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off by default.\r\n\r\nIf you enable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you disable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off.\r\n\r\nIf you don\u0027t configure this setting, users can choose whether to use potentially unwanted app blocking with Microsoft Defender SmartScreen.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
        "DisplayName": "Configure Microsoft Defender SmartScreen to block potentially unwanted apps",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "SmartScreenPuaEnabled",
          "Configure Microsoft Defender SmartScreen to block potentially unwanted apps",
          "\\Microsoft Edge\\SmartScreen settings",
          "Microsoft Edge\\SmartScreen settings",
          "SmartScreen settings"
        ],
        "Name": "SmartScreenPuaEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev80diff~Policy~microsoft_edge~SmartScreen/SmartScreenPuaEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "12ff32ac-8899-4936-8ce1-206d6df0eca6"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "7",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy setting lets you decide whether users can override the Microsoft Defender SmartScreen warnings about potentially malicious websites.\r\n\r\nIf you enable this setting, users can\u0027t ignore Microsoft Defender SmartScreen warnings and they are blocked from continuing to the site.\r\n\r\nIf you disable or don\u0027t configure this setting, users can ignore Microsoft Defender SmartScreen warnings and continue to the site.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
        "DisplayName": "Prevent bypassing Microsoft Defender SmartScreen prompts for sites",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "PreventSmartScreenPromptOverride",
          "Prevent bypassing Microsoft Defender SmartScreen prompts for sites",
          "\\Microsoft Edge\\SmartScreen settings",
          "Microsoft Edge\\SmartScreen settings",
          "SmartScreen settings"
        ],
        "Name": "PreventSmartScreenPromptOverride",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/PreventSmartScreenPromptOverride",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "90dd2915-f1d5-4ce1-a4ae-2e32055df32f"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "8",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy lets you determine whether users can override Microsoft Defender SmartScreen warnings about unverified downloads.\r\n\r\nIf you enable this policy, users in your organization can\u0027t ignore Microsoft Defender SmartScreen warnings, and they\u0027re prevented from completing the unverified downloads.\r\n\r\nIf you disable or don\u0027t configure this policy, users can ignore Microsoft Defender SmartScreen warnings and complete unverified downloads.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
        "DisplayName": "Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "PreventSmartScreenPromptOverrideForFiles",
          "Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads",
          "\\Microsoft Edge\\SmartScreen settings",
          "Microsoft Edge\\SmartScreen settings",
          "SmartScreen settings"
        ],
        "Name": "PreventSmartScreenPromptOverrideForFiles",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/PreventSmartScreenPromptOverrideForFiles",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "5b7881b3-e97f-4df3-85f4-d702876edf6a"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "9",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy setting lets you configure whether to turn on Edge TyposquattingChecker. Edge TyposquattingChecker provides warning messages to help protect your users from potential typosquatting sites. By default, Edge TyposquattingChecker is turned on.\r\n\r\nIf you enable this policy, Edge TyposquattingChecker is turned on.\r\n\r\nIf you disable this policy, Edge TyposquattingChecker is turned off.\r\n\r\nIf you don\u0027t configure this policy, Edge TyposquattingChecker is turned on but users can choose whether to use Edge TyposquattingChecker.",
        "DisplayName": "Configure Edge TyposquattingChecker",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "TyposquattingCheckerEnabled",
          "Configure Edge TyposquattingChecker",
          "\\Microsoft Edge\\TyposquattingChecker settings",
          "Microsoft Edge\\TyposquattingChecker settings",
          "Typosquatting Checker settings"
        ],
        "Name": "TyposquattingCheckerEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge~TyposquattingChecker/TyposquattingCheckerEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "c2e33b1a-d2d1-4980-be1a-ef54b3429031"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "10",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy allows users to reload unconfigured sites (that are not configured in the Enterprise Mode Site List) in Internet Explorer mode when browsing in Microsoft Edge and a site requires Internet Explorer for compatibility.\r\n\r\nAfter a site has been reloaded in Internet Explorer mode, \"in-page\" navigations will stay in Internet Explorer mode (for example, a link, script, or form on the page, or a server-side redirect from another \"in-page\" navigation). Users can choose to exit from Internet Explorer mode, or Microsoft Edge will automatically exit from Internet Explorer mode when a navigation that isn\u0027t \"in-page\" occurs (for example, using the address bar, the back button, or a favorite link).\r\n\r\nUsers can also optionally tell Microsoft Edge to use Internet Explorer mode for the site in the future. This choice will be remembered for a length of time managed by the \u0027InternetExplorerIntegrationLocalSiteListExpirationDays\u0027 (Specify the number of days that a site remains on the local IE mode site list) policy.\r\n\r\nIf the \u0027InternetExplorerIntegrationLevel\u0027 (Configure Internet Explorer integration) policy is set to \u0027IEMode\u0027, then sites explicitly configured by the \u0027InternetExplorerIntegrationSiteList\u0027 (Configure the Enterprise Mode Site List) policy\u0027s site list to use Microsoft Edge can\u0027t be reloaded in Internet Explorer mode, and sites configured by the site list or by the \u0027SendIntranetToInternetExplorer\u0027 (Send all intranet sites to Internet Explorer) policy to use Internet Explorer mode can\u0027t exit from Internet Explorer mode.\r\n\r\nIf you enable this policy, users are allowed to reload unconfigured sites in Internet Explorer mode.\r\n\r\nIf you disable this policy, users aren\u0027t allowed to reload unconfigured sites in Internet Explorer mode.\r\n\r\nNote that if you enable this policy, it takes precedence over how you configured the \u0027InternetExplorerIntegrationTestingAllowed\u0027 (Allow Internet Explorer mode testing) policy, and that policy will be disabled.\r\n\r\nTo learn more about Internet Explorer mode, see https://go.microsoft.com/fwlink/?linkid=2094210",
        "DisplayName": "Allow unconfigured sites to be reloaded in Internet Explorer mode",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "InternetExplorerIntegrationReloadInIEModeAllowed",
          "Allow unconfigured sites to be reloaded in Internet Explorer mode",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "InternetExplorerIntegrationReloadInIEModeAllowed",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev92~Policy~microsoft_edge/InternetExplorerIntegrationReloadInIEModeAllowed",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "fd416796-3442-405c-9f9e-e1ca3c0b9e3f"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "11",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Microsoft Edge shows a warning page when users visit sites that have SSL errors.\r\n\r\nIf you enable or don\u0027t configure (default) this policy, users can click through these warning pages.\r\n\r\nIf you disable this policy, users are blocked from clicking through any warning page.",
        "DisplayName": "Allow users to proceed from the HTTPS warning page",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "SSLErrorOverrideAllowed",
          "Allow users to proceed from the HTTPS warning page",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "SSLErrorOverrideAllowed",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/SSLErrorOverrideAllowed",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "f4f34d05-9bbd-48a4-aa86-84add2b23657"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "12",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This policy controls whether MHT or MHTML files that are downloaded from the web are automatically opened in Internet Explorer mode.\r\n\r\nIf you enable this policy, the MHT or MHTML files that are downloaded from the web can be opened in both Microsoft Edge and Internet Explorer mode to provide the best user experience.\r\n\r\nIf you disable or don\u0027t configure this policy, MHT or MHTML files that are downloaded from the web won\u0027t automatically open in Internet Explorer mode.\r\n\r\nTo learn more about Internet Explorer mode, see https://go.microsoft.com/fwlink/?linkid=2094210",
        "DisplayName": "Automatically open downloaded MHT or MHTML files from the web in Internet Explorer mode",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
          "Automatically open downloaded MHT or MHTML files from the web in Internet Explorer mode",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev117~Policy~microsoft_edge/InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "ba15aa09-ea95-49bd-92bf-de9cec9c1146"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "13",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Sets the ProcessExtensionPointDisablePolicy on Microsoft Edge\u0027s browser process to block code injection from legacy third party applications.\r\n\r\nIf you enable or don\u0027t configure this policy, the ProcessExtensionPointDisablePolicy is applied to block legacy extension points in the browser process.\r\n\r\nIf you disable this policy, the ProcessExtensionPointDisablePolicy is not applied to block legacy extension points in the browser process. This has a detrimental effect on Microsoft Edge\u0027s security and stability as unknown and potentially hostile code can load inside Microsoft Edge\u0027s browser process. Only turn off the policy if there are compatibility issues with third-party software that must run inside Microsoft Edge\u0027s browser process.",
        "DisplayName": "Enable browser legacy extension point blocking",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "BrowserLegacyExtensionPointsBlockingEnabled",
          "Enable browser legacy extension point blocking",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "BrowserLegacyExtensionPointsBlockingEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev95~Policy~microsoft_edge/BrowserLegacyExtensionPointsBlockingEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "244ad831-d65d-414b-bcd7-7cc7065d93c0"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "14",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "\r\nThe \u0027SitePerProcess\u0027 policy can be used to prevent users from opting out of the default behavior of isolating all sites. Note that you can also use the \u0027IsolateOrigins\u0027 (Enable site isolation for specific origins) policy to isolate additional, finer-grained origins.\r\nIf you enable this policy, users can\u0027t opt out of the default behavior where each site runs in its own process.\r\nIf you disable or don’t configure this policy, a user can opt out of site isolation.  (For example, by using \"Disable site isolation\" entry in edge://flags.)  Disabling the policy or not configuring the policy doesn\u0027t turn off Site Isolation.\r\n",
        "DisplayName": "Enable site isolation for every site",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "SitePerProcess",
          "Enable site isolation for every site",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "SitePerProcess",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/SitePerProcess",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "3d1b6b01-aa72-42a5-bb9e-1425a5289973"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "15",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Set whether Microsoft Edge can automatically enhance images to show you sharper images with better color, lighting, and contrast.\r\n\r\nIf you enable this policy or don\u0027t configure the policy, Microsoft Edge will automatically enhance images on specific web applications.\r\n\r\nIf you disable this policy, Microsoft Edge will not enhance images.",
        "DisplayName": "Enhance images enabled",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "EdgeEnhanceImagesEnabled",
          "Enhance images enabled",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "EdgeEnhanceImagesEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev97~Policy~microsoft_edge/EdgeEnhanceImagesEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "9d1101a5-870a-4cab-bdcf-09ffd5475d50"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "16",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "WebSQL is on by default as of Microsoft Edge version 101, but can be disabled via a Microsoft Edge flag.\r\nIf you enable this policy, WebSQL cannot be disabled.\r\nIf you disable or don\u0027t configure this policy, WebSQL can be disabled.",
        "DisplayName": "Force WebSQL to be enabled",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "WebSQLAccess",
          "Force WebSQL to be enabled",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "WebSQLAccess",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev107~Policy~microsoft_edge/WebSQLAccess",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "e74a4383-7069-4381-a4ba-4a56b5f7b85c"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "17",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Set this policy to show the Reload in Internet Explorer mode button in the toolbar. Users can hide the button in the toolbar through edge://settings/appearance.  The button will only be shown on the toolbar when the \u0027InternetExplorerIntegrationReloadInIEModeAllowed\u0027 (Allow unconfigured sites to be reloaded in Internet Explorer mode) policy is enabled or if the user has chosen to enable \"Allow sites to be reloaded in Internet Explorer mode\".\r\n\r\nIf you enable this policy, the Reload in Internet mode button is pinned to the toolbar.\r\n\r\nIf you disable or don\u0027t configure this policy, the Reload in Internet Explorer mode button isn\u0027t shown in the toolbar by default. Users can toggle the Show Internet Explorer mode button in edge://settings/appearance.",
        "DisplayName": "Show the Reload in Internet Explorer mode button in the toolbar",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "InternetExplorerModeToolbarButtonEnabled",
          "Show the Reload in Internet Explorer mode button in the toolbar",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "InternetExplorerModeToolbarButtonEnabled",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge/InternetExplorerModeToolbarButtonEnabled",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "40b5a825-fbda-41c2-a00f-162139d8cd25"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "18",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context.  A SharedArrayBuffer is a binary data buffer that can be used to create views on shared memory.  SharedArrayBuffers have a memory access vulnerability in several popular CPUs.\r\n\r\nIf you enable this policy, sites are allowed to use SharedArrayBuffers with no restrictions.\r\n\r\nIf you disable or don\u0027t configure this policy, sites are allowed to use SharedArrayBuffers only when cross-origin isolated.\r\n\r\nMicrosoft Edge will require cross-origin isolation when using SharedArrayBuffers from Microsoft Edge 91 onward for Web Compatibility reasons.",
        "DisplayName": "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "SharedArrayBufferUnrestrictedAccessAllowed",
          "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
          "\\Microsoft Edge",
          "Microsoft Edge"
        ],
        "Name": "SharedArrayBufferUnrestrictedAccessAllowed",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/Config/microsoft_edgev111~Policy~microsoft_edge/SharedArrayBufferUnrestrictedAccessAllowed",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "65f6b4ba-d54a-439a-8fe9-1b2e7eb2eb9f"
      }
    },
    "AdditionalProperties": {
      
    }
  }
]
