[
  {
    "Id": "0",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This policy setting allows you to configure the encryption type used by BitLocker Drive Encryption. This policy setting is applied when you turn on BitLocker. Changing the encryption type has no effect if the drive is already encrypted or if encryption is in progress. Choose full encryption to require that the entire drive be encrypted when BitLocker is turned on. Choose used space only encryption to require that only the portion of the drive used to store data is encrypted when BitLocker is turned on.\r\n\r\nIf you enable this policy setting the encryption type that BitLocker will use to encrypt drives is defined by this policy and the encryption type option will not be presented in the BitLocker setup wizard.\r\n\r\nIf you disable or do not configure this policy setting, the BitLocker setup wizard will ask the user to select the encryption type before turning on BitLocker.\r\n\r\n      \n ",
        "DisplayName": "Enforce drive encryption type on fixed data drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/BitLocker-csp/"
        ],
        "Keywords": [
          "FDVEncryptionType_Name",
          "Enforce drive encryption type on fixed data drives",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVEncryptionType_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/FixedDrivesEncryptionType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_0\",\r\n    \"name\": \"Allow user to choose (default)\",\r\n    \"displayName\": \"Allow user to choose (default)\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1\",\r\n    \"name\": \"Full encryption\",\r\n    \"displayName\": \"Full encryption\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2\",\r\n    \"name\": \"Used Space Only encryption\",\r\n    \"displayName\": \"Used Space Only encryption\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Select the encryption type: (Device)",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "FDVEncryptionType_Name",
          "Enforce drive encryption type on fixed data drives",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVEncryptionTypeDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/FixedDrivesEncryptionType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "1",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Save BitLocker recovery information to AD DS for fixed data drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVActiveDirectoryBackup_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Omit recovery options from the BitLocker setup wizard",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVHideRecoveryPage_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2\",\r\n    \"name\": \"Allow 48-digit recovery password\",\r\n    \"displayName\": \"Allow 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_1\",\r\n    \"name\": \"Require 48-digit recovery password\",\r\n    \"displayName\": \"Require 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_0\",\r\n    \"name\": \"Do not allow 48-digit recovery password\",\r\n    \"displayName\": \"Do not allow 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "\r\nConfigure user storage of BitLocker recovery information:\r\n",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVRecoveryPasswordUsageDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This policy setting allows you to control how BitLocker-protected fixed data drives are recovered in the absence of the required credentials. This policy setting is applied when you turn on BitLocker.\r\n\r\nThe \"Allow data recovery agent\" check box is used to specify whether a data recovery agent can be used with BitLocker-protected fixed data drives. Before a data recovery agent can be used it must be added from the Public Key Policies item in either the Group Policy Management Console or the Local Group Policy Editor. Consult the BitLocker Drive Encryption Deployment Guide on Microsoft TechNet for more information about adding data recovery agents.\r\n\r\nIn \"Configure user storage of BitLocker recovery information\" select whether users are allowed, required, or not allowed to generate a 48-digit recovery password or a 256-bit recovery key.\r\n\r\nSelect \"Omit recovery options from the BitLocker setup wizard\" to prevent users from specifying recovery options when they turn on BitLocker on a drive. This means that you will not be able to specify which recovery option to use when you turn on BitLocker, instead BitLocker recovery options for the drive are determined by the policy setting.\r\n\r\nIn \"Save BitLocker recovery information to Active Directory Domain Services\" choose which BitLocker recovery information to store in AD DS for fixed data drives. If you select \"Backup recovery password and key package\", both the BitLocker recovery password and key package are stored in AD DS. Storing the key package supports recovering data from a drive that has been physically corrupted. If you select \"Backup recovery password only,\" only the recovery password is stored in AD DS.\r\n\r\nSelect the \"Do not enable BitLocker until recovery information is stored in AD DS for fixed data drives\" check box if you want to prevent users from enabling BitLocker unless the computer is connected to the domain and the backup of BitLocker recovery information to AD DS succeeds.\r\n\r\nNote: If the \"Do not enable BitLocker until recovery information is stored in AD DS for fixed data drives\" check box is selected, a recovery password is automatically generated.\r\n\r\nIf you enable this policy setting, you can control the methods available to users to recover data from BitLocker-protected fixed data drives.\r\n\r\nIf this policy setting is not configured or disabled, the default recovery options are supported for BitLocker recovery. By default a DRA is allowed, the recovery options can be specified by the user including the recovery password and recovery key, and recovery information is not backed up to AD DS\r\n\r\n",
        "DisplayName": "Choose how BitLocker-protected fixed drives can be recovered",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVRecoveryUsage_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Do not enable BitLocker until recovery information is stored to AD DS for fixed data drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVRequireActiveDirectoryBackup_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Allow data recovery agent",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVAllowDRA_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1\",\r\n    \"name\": \"Backup recovery passwords and key packages\",\r\n    \"displayName\": \"Backup recovery passwords and key packages\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_2\",\r\n    \"name\": \"Backup recovery passwords only\",\r\n    \"displayName\": \"Backup recovery passwords only\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Configure storage of BitLocker recovery information to AD DS:",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVActiveDirectoryBackupDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2\",\r\n    \"name\": \"Allow 256-bit recovery key\",\r\n    \"displayName\": \"Allow 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_1\",\r\n    \"name\": \"Require 256-bit recovery key\",\r\n    \"displayName\": \"Require 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_0\",\r\n    \"name\": \"Do not allow 256-bit recovery key\",\r\n    \"displayName\": \"Do not allow 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "FDVRecoveryUsage_Name",
          "Choose how BitLocker-protected fixed drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Fixed Data Drives",
          "Fixed Data Drives"
        ],
        "Name": "FDVRecoveryKeyUsageDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/FixedDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "2",
    "SettingDefinitions": [
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_0\",\r\n    \"name\": \"Allow user to choose (default)\",\r\n    \"displayName\": \"Allow user to choose (default)\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1\",\r\n    \"name\": \"Full encryption\",\r\n    \"displayName\": \"Full encryption\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2\",\r\n    \"name\": \"Used Space Only encryption\",\r\n    \"displayName\": \"Used Space Only encryption\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Select the encryption type: (Device)",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "OSEncryptionType_Name",
          "Enforce drive encryption type on operating system drives",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSEncryptionTypeDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/SystemDrivesEncryptionType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "none",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This policy setting allows you to configure the encryption type used by BitLocker Drive Encryption. This policy setting is applied when you turn on BitLocker. Changing the encryption type has no effect if the drive is already encrypted or if encryption is in progress. Choose full encryption to require that the entire drive be encrypted when BitLocker is turned on. Choose used space only encryption to require that only the portion of the drive used to store data is encrypted when BitLocker is turned on.\r\n\r\nIf you enable this policy setting the encryption type that BitLocker will use to encrypt drives is defined by this policy and the encryption type option will not be presented in the BitLocker setup wizard.\r\n\r\nIf you disable or do not configure this policy setting, the BitLocker setup wizard will ask the user to select the encryption type before turning on BitLocker.\r\n\r\n      \n ",
        "DisplayName": "Enforce drive encryption type on operating system drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/BitLocker-csp/"
        ],
        "Keywords": [
          "OSEncryptionType_Name",
          "Enforce drive encryption type on operating system drives",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSEncryptionType_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/SystemDrivesEncryptionType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "3",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Do not enable BitLocker until recovery information is stored to AD DS for operating system drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSRequireActiveDirectoryBackup_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Save BitLocker recovery information to AD DS for operating system drives",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSActiveDirectoryBackup_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2\",\r\n    \"name\": \"Allow 48-digit recovery password\",\r\n    \"displayName\": \"Allow 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_1\",\r\n    \"name\": \"Require 48-digit recovery password\",\r\n    \"displayName\": \"Require 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_0\",\r\n    \"name\": \"Do not allow 48-digit recovery password\",\r\n    \"displayName\": \"Do not allow 48-digit recovery password\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "\r\nConfigure user storage of BitLocker recovery information:\r\n",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSRecoveryPasswordUsageDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This policy setting allows you to control how BitLocker-protected operating system drives are recovered in the absence of the required startup key information. This policy setting is applied when you turn on BitLocker.\r\n\r\nThe \"Allow certificate-based data recovery agent\" check box is used to specify whether a data recovery agent can be used with BitLocker-protected operating system drives. Before a data recovery agent can be used it must be added from the Public Key Policies item in either the Group Policy Management Console or the Local Group Policy Editor. Consult the BitLocker Drive Encryption Deployment Guide on Microsoft TechNet for more information about adding data recovery agents.\r\n\r\nIn \"Configure user storage of BitLocker recovery information\" select whether users are allowed, required, or not allowed to generate a 48-digit recovery password or a 256-bit recovery key.\r\n\r\nSelect \"Omit recovery options from the BitLocker setup wizard\" to prevent users from specifying recovery options when they turn on BitLocker on a drive. This means that you will not be able to specify which recovery option to use when you turn on BitLocker, instead BitLocker recovery options for the drive are determined by the policy setting.\r\n\r\nIn \"Save BitLocker recovery information to Active Directory Domain Services\", choose which BitLocker recovery information to store in AD DS for operating system drives. If you select \"Backup recovery password and key package\", both the BitLocker recovery password and key package are stored in AD DS. Storing the key package supports recovering data from a drive that has been physically corrupted. If you select \"Backup recovery password only,\" only the recovery password is stored in AD DS.\r\n\r\nSelect the \"Do not enable BitLocker until recovery information is stored in AD DS for operating system drives\" check box if you want to prevent users from enabling BitLocker unless the computer is connected to the domain and the backup of BitLocker recovery information to AD DS succeeds.\r\n\r\nNote: If the \"Do not enable BitLocker until recovery information is stored in AD DS for operating system drives\" check box is selected, a recovery password is automatically generated.\r\n\r\nIf you enable this policy setting, you can control the methods available to users to recover data from BitLocker-protected operating system drives.\r\n\r\nIf this policy setting is disabled or not configured, the default recovery options are supported for BitLocker recovery. By default a DRA is allowed, the recovery options can be specified by the user including the recovery password and recovery key, and recovery information is not backed up to AD DS.\r\n\r\n",
        "DisplayName": "Choose how BitLocker-protected operating system drives can be recovered",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSRecoveryUsage_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Omit recovery options from the BitLocker setup wizard",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSHideRecoveryPage_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0\",\r\n    \"name\": \"False\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_1\",\r\n    \"name\": \"True\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Allow data recovery agent",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSAllowDRA_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2\",\r\n    \"name\": \"Allow 256-bit recovery key\",\r\n    \"displayName\": \"Allow 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_1\",\r\n    \"name\": \"Require 256-bit recovery key\",\r\n    \"displayName\": \"Require 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_0\",\r\n    \"name\": \"Do not allow 256-bit recovery key\",\r\n    \"displayName\": \"Do not allow 256-bit recovery key\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"0\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSRecoveryKeyUsageDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1\",\r\n    \"name\": \"Store recovery passwords and key packages\",\r\n    \"displayName\": \"Store recovery passwords and key packages\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_2\",\r\n    \"name\": \"Store recovery passwords only\",\r\n    \"displayName\": \"Store recovery passwords only\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Configure storage of BitLocker recovery information to AD DS:",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "OSRecoveryUsage_Name",
          "Choose how BitLocker-protected operating system drives can be recovered",
          "\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption\\Operating System Drives",
          "Operating System Drives"
        ],
        "Name": "OSActiveDirectoryBackupDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/SystemDrivesRecoveryOptions",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "4",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_3\",\r\n    \"name\": \"AES-CBC 128-bit\",\r\n    \"displayName\": \"AES-CBC 128-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_4\",\r\n    \"name\": \"AES-CBC 256-bit\",\r\n    \"displayName\": \"AES-CBC 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6\",\r\n    \"name\": \"XTS-AES 128-bit (default)\",\r\n    \"displayName\": \"XTS-AES 128-bit (default)\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7\",\r\n    \"name\": \"XTS-AES 256-bit\",\r\n    \"displayName\": \"XTS-AES 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"7\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Select the encryption method for operating system drives:",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#encryptionmethodbydrivetype"
        ],
        "Keywords": [
          "EncryptionMethodWithXts_Name",
          "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
          "\\Windows Components\\BitLocker Drive Encryption",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
          "BitLocker Drive Encryption"
        ],
        "Name": "EncryptionMethodWithXtsOsDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/EncryptionMethodByDriveType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_3\",\r\n    \"name\": \"AES-CBC 128-bit\",\r\n    \"displayName\": \"AES-CBC 128-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_4\",\r\n    \"name\": \"AES-CBC 256-bit\",\r\n    \"displayName\": \"AES-CBC 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6\",\r\n    \"name\": \"XTS-AES 128-bit (default)\",\r\n    \"displayName\": \"XTS-AES 128-bit (default)\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7\",\r\n    \"name\": \"XTS-AES 256-bit\",\r\n    \"displayName\": \"XTS-AES 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"7\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Select the encryption method for fixed data drives:",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#encryptionmethodbydrivetype"
        ],
        "Keywords": [
          "EncryptionMethodWithXts_Name",
          "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
          "\\Windows Components\\BitLocker Drive Encryption",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
          "BitLocker Drive Encryption"
        ],
        "Name": "EncryptionMethodWithXtsFdvDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/EncryptionMethodByDriveType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name\",\r\n        \"required\": true\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This policy setting allows you to configure the algorithm and cipher strength used by BitLocker Drive Encryption. This policy setting is applied when you turn on BitLocker. Changing the encryption method has no effect if the drive is already encrypted, or if encryption is in progress.\r\n\r\nIf you enable this policy setting you will be able to configure an encryption algorithm and key cipher strength for fixed data drives, operating system drives, and removable data drives individually. For fixed and operating system drives, we recommend that you use the XTS-AES algorithm. For removable drives, you should use AES-CBC 128-bit or AES-CBC 256-bit if the drive will be used in other devices that are not running Windows 10 (Version 1511).\r\n\r\nIf you disable or do not configure this policy setting, BitLocker will use AES with the same bit strength (128-bit or 256-bit) as the \"Choose drive encryption method and cipher strength (Windows Vista, Windows Server 2008, Windows 7)\" and \"Choose drive encryption method and cipher strength\" policy settings (in that order), if they are set. If none of the policies are set, BitLocker will use the default encryption method of XTS-AES 128-bit or the encryption method specified by the setup script.”\r\n\r\n      ",
        "DisplayName": "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#encryptionmethodbydrivetype"
        ],
        "Keywords": [
          "EncryptionMethodWithXts_Name",
          "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
          "\\Windows Components\\BitLocker Drive Encryption",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
          "BitLocker Drive Encryption"
        ],
        "Name": "EncryptionMethodWithXts_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/EncryptionMethodByDriveType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3\",\r\n    \"name\": \"AES-CBC 128-bit  (default)\",\r\n    \"displayName\": \"AES-CBC 128-bit  (default)\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4\",\r\n    \"name\": \"AES-CBC 256-bit\",\r\n    \"displayName\": \"AES-CBC 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6\",\r\n    \"name\": \"XTS-AES 128-bit\",\r\n    \"displayName\": \"XTS-AES 128-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_7\",\r\n    \"name\": \"XTS-AES 256-bit\",\r\n    \"displayName\": \"XTS-AES 256-bit\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"7\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_encryptionmethodbydrivetype\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Select the encryption method for removable data drives:",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#encryptionmethodbydrivetype"
        ],
        "Keywords": [
          "EncryptionMethodWithXts_Name",
          "Choose drive encryption method and cipher strength (Windows 10 [Version 1511] and later)",
          "\\Windows Components\\BitLocker Drive Encryption",
          "Administrative Templates\\Windows Components\\BitLocker Drive Encryption",
          "BitLocker Drive Encryption"
        ],
        "Name": "EncryptionMethodWithXtsRdvDropDown_Name",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/EncryptionMethodByDriveType",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "5",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_requiredeviceencryption_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_requiredeviceencryption_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Allows the Admin to require encryption to be turned on using BitLocker\\Device Encryption.\n                         The format is integer.\n                         Sample value for this node to enable this policy:\n                         1\n\n                         Disabling the policy will not turn off the encryption on the system drive. But will stop prompting the user to turn it on.\n                         If you want to disable this policy use the following SyncML:\n                         101./Device/Vendor/MSFT/BitLocker/RequireDeviceEncryptionint0",
        "DisplayName": "Require Device Encryption",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "Require Device Encryption",
          "BitLocker"
        ],
        "Name": "RequireDeviceEncryption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/RequireDeviceEncryption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "6",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_allowstandarduserencryption_0\",\r\n    \"description\": \"This is the default, when the policy is not set. If current logged on user is a standard user, \\\"RequireDeviceEncryption\\\" policy will not try to enable encryption on any drive.\",\r\n    \"name\": \"This is the default, when the policy is not set. If current logged on user is a standard user, \\\"RequireDeviceEncryption\\\" policy will not try to enable encryption on any drive.\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_allowstandarduserencryption_1\",\r\n    \"description\": \"\\\"RequireDeviceEncryption\\\" policy will try to enable encryption on all fixed drives even if a current logged in user is standard user.\",\r\n    \"name\": \"\\\"RequireDeviceEncryption\\\" policy will try to enable encryption on all fixed drives even if a current logged in user is standard user.\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0\",\r\n        \"parentSettingId\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Allows Admin to enforce \"RequireDeviceEncryption\" policy for scenarios where policy is pushed while current logged on user is non-admin/standard user.\n                         \"AllowStandardUserEncryption\" policy is tied to \"AllowWarningForOtherDiskEncryption\" policy  being set to \"0\", i.e, Silent encryption is enforced.\n                         If \"AllowWarningForOtherDiskEncryption\" is not set, or is set to \"1\", \"RequireDeviceEncryption\" policy will not try to encrypt drive(s) if a standard user\n                         is the current logged on user in the system.\n\n                         The expected values for this policy are: \n\n                         1 = \"RequireDeviceEncryption\" policy will try to enable encryption on all fixed drives even if a current logged in user is standard user.\n                         0 = This is the default, when the policy is not set. If current logged on user is a standard user, \"RequireDeviceEncryption\" policy\n                             will not try to enable encryption on any drive.\n\n                         If you want to disable this policy use the following SyncML:\n                         111./Device/Vendor/MSFT/BitLocker/AllowStandardUserEncryptionint0",
        "DisplayName": "Allow Standard User Encryption",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_allowstandarduserencryption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp"
        ],
        "Keywords": [
          "Allow Standard User Encryption",
          "BitLocker"
        ],
        "Name": "AllowStandardUserEncryption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/AllowStandardUserEncryption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/BitLocker",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0\",\r\n    \"name\": \"Disabled\",\r\n    \"displayName\": \"Disabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_bitlocker_allowstandarduserencryption\",\r\n        \"required\": false\r\n      }\r\n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_1\",\r\n    \"name\": \"Enabled\",\r\n    \"displayName\": \"Enabled\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Allows Admin to disable all UI (notification for encryption and warning prompt for other disk encryption)\n                         and turn on encryption on the user machines silently.\n                         Warning: When you enable BitLocker on a device with third party encryption, it may render the device unusable and will\n                         require reinstallation of Windows.\n                         Note: This policy takes effect only if \"RequireDeviceEncryption\" policy is set to 1.\n                         The format is integer.\n                         The expected values for this policy are: \n\n                         1 = This is the default, when the policy is not set. Warning prompt and encryption notification is allowed.\n                         0 = Disables the warning prompt and encryption notification. Starting in Windows 10, next major update, \n                             the value 0 only takes affect on Azure Active Directory joined devices. \n                             Windows will attempt to silently enable BitLocker for value 0.\n\n                         If you want to disable this policy use the following SyncML:\n                         110./Device/Vendor/MSFT/BitLocker/AllowWarningForOtherDiskEncryptionint0",
        "DisplayName": "Allow Warning For Other Disk Encryption",
        "HelpText": "",
        "Id": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/bitlocker-csp#allowwarningforotherdiskencryption"
        ],
        "Keywords": [
          "Allow Warning For Other Disk Encryption",
          "BitLocker"
        ],
        "Name": "AllowWarningForOtherDiskEncryption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/AllowWarningForOtherDiskEncryption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
      }
    },
    "AdditionalProperties": {
      
    }
  }
]
