{
  "Id": "0",
  "SettingDefinitions": [
    {
      "AccessTypes": "get,replace",
      "Applicability": {
        "Description": null,
        "DeviceMode": {
          
        },
        "Platform": {
          
        },
        "Technologies": {
          
        }
      },
      "BaseUri": "./Device/Vendor/MSFT/WindowsAdvancedThreatProtection",
      "CategoryId": "",
      "Description": "Set Windows Defender Advanced Threat Protection Onboarding blob and initiate onboarding to Windows Defender Advanced Threat Protection",
      "DisplayName": "Onboarding (Device)",
      "HelpText": null,
      "Id": "device_vendor_msft_windowsadvancedthreatprotection_onboarding",
      "InfoUrls": [
        
      ],
      "Keywords": [
        "Onboarding",
        "WindowsAdvancedThreatProtection",
        "Windows Advanced Threat Protection",
        "Microsoft Defender for Endpoint"
      ],
      "Name": "Onboarding",
      "Occurrence": {
        "MaxDeviceOccurrence": 1,
        "MinDeviceOccurrence": 1
      },
      "OffsetUri": "/Onboarding",
      "ReferredSettingInformationList": [
        
      ],
      "RootDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
      "SettingUsage": {
        
      },
      "UxBehavior": {
        
      },
      "Version": "638609848155120837",
      "Visibility": {
        
      }
    },
    {
      "AccessTypes": "get,replace",
      "Applicability": {
        "Description": null,
        "DeviceMode": {
          
        },
        "Platform": {
          
        },
        "Technologies": {
          
        }
      },
      "BaseUri": "./Device/Vendor/MSFT/WindowsAdvancedThreatProtection",
      "CategoryId": "",
      "Description": "Set Windows Defender Advanced Threat Protection Offboarding blob and initiate offboarding",
      "DisplayName": "Offboarding (Device)",
      "HelpText": null,
      "Id": "device_vendor_msft_windowsadvancedthreatprotection_offboarding",
      "InfoUrls": [
        
      ],
      "Keywords": [
        "Offboarding",
        "WindowsAdvancedThreatProtection",
        "Windows Advanced Threat Protection",
        "Microsoft Defender for Endpoint"
      ],
      "Name": "Offboarding",
      "Occurrence": {
        "MaxDeviceOccurrence": 1,
        "MinDeviceOccurrence": 1
      },
      "OffsetUri": "/Offboarding",
      "ReferredSettingInformationList": [
        
      ],
      "RootDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
      "SettingUsage": {
        
      },
      "UxBehavior": {
        
      },
      "Version": "638609848155120837",
      "Visibility": {
        
      }
    },
    {
      "AccessTypes": "get,replace",
      "Applicability": {
        "Description": null,
        "DeviceMode": {
          
        },
        "Platform": {
          
        },
        "Technologies": {
          
        }
      },
      "BaseUri": "./Device/Vendor/MSFT/WindowsAdvancedThreatProtection",
      "CategoryId": "",
      "Description": "Set Windows Defender Advanced Threat Protection Onboarding blob and initiate onboarding to Windows Defender Advanced Threat Protection",
      "DisplayName": "Onboarding blob from Connector",
      "HelpText": null,
      "Id": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
      "InfoUrls": [
        
      ],
      "Keywords": [
        "Onboarding",
        "WindowsAdvancedThreatProtection",
        "Windows Advanced Threat Protection",
        "Microsoft Defender for Endpoint"
      ],
      "Name": "Onboarding",
      "Occurrence": {
        "MaxDeviceOccurrence": 1,
        "MinDeviceOccurrence": 1
      },
      "OffsetUri": "/Onboarding",
      "ReferredSettingInformationList": [
        
      ],
      "RootDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
      "SettingUsage": {
        
      },
      "UxBehavior": {
        
      },
      "Version": "638609848155120837",
      "Visibility": {
        
      }
    },
    {
      "AccessTypes": "get,replace",
      "Applicability": {
        "Description": null,
        "DeviceMode": {
          
        },
        "Platform": {
          
        },
        "Technologies": {
          
        }
      },
      "BaseUri": "./Device/Vendor/MSFT/WindowsAdvancedThreatProtection",
      "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector\",\r\n    \"name\": \"AutoFromConnector\",\r\n    \"displayName\": \"Auto from connector\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"AutoFromConnector\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_onboard\",\r\n    \"name\": \"Onboard\",\r\n    \"displayName\": \"Onboard\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"Onboard\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_windowsadvancedthreatprotection_onboarding\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_offboard\",\r\n    \"name\": \"Offboard\",\r\n    \"displayName\": \"Offboard\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"Offboard\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"device_vendor_msft_windowsadvancedthreatprotection_offboarding\",\r\n        \"required\": true\r\n      }\r\n    ]\r\n  }\r\n]",
      "Description": "Microsoft Defender for Endpoint endpoint detection and response capabilities provide advanced attack detections that are near real-time and actionable. Security analysts can prioritize alerts effectively, gain visibility into the full scope of a breach, and take response actions to remediate threats.",
      "DisplayName": "Microsoft Defender for Endpoint client configuration package type",
      "HelpText": null,
      "Id": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
      "InfoUrls": [
        
      ],
      "Keywords": [
        "Sample Sharing",
        "WindowsAdvancedThreatProtection",
        "Microsoft Defender for Endpoint"
      ],
      "Name": "ClientConfigurationPackageType",
      "Occurrence": {
        "MaxDeviceOccurrence": 1,
        "MinDeviceOccurrence": 1
      },
      "OffsetUri": "/",
      "ReferredSettingInformationList": [
        
      ],
      "RootDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
      "SettingUsage": {
        
      },
      "UxBehavior": {
        
      },
      "Version": "638609848155120837",
      "Visibility": {
        
      }
    }
  ],
  "SettingInstance": {
    "SettingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
    "SettingInstanceTemplateReference": {
      "SettingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
    }
  },
  "AdditionalProperties": {
    
  }
}
