[
  {
    "Id": "0",
    "SettingDefinitions": [
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false\",\r\n    \"description\": \"Unicast Responses Not Blocked\",\r\n    \"name\": \"Unicast Responses Not Blocked\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_true\",\r\n    \"description\": \"Unicast Responses Blocked\",\r\n    \"name\": \"Unicast Responses Blocked\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If it is true, unicast responses to multicast broadcast traffic is blocked.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Unicast Responses To Multicast Broadcast",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Unicast Responses To Multicast Broadcast",
          "Firewall"
        ],
        "Name": "DisableUnicastResponsesToMulticastBroadcast",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DisableUnicastResponsesToMulticastBroadcast",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_false\",\r\n    \"description\": \"Disable Logging Of Ignored Rules\",\r\n    \"name\": \"Disable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Disable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_true\",\r\n    \"description\": \"Enable Logging Of Ignored Rules\",\r\n    \"name\": \"Enable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Enable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. The server MAY use this value in an implementation-specific way to control logging of events if a rule is not enforced for any reason. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Ignored Rules",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Ignored Rules",
          "Firewall"
        ],
        "Name": "EnableLogIgnoredRules",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/EnableLogIgnoredRules",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_false\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, global port firewall rules in the local store are ignored and not enforced. The setting only has meaning if it is set or enumerated in the Group Policy store or if it is enumerated from the GroupPolicyRSoPStore.  The merge law for this option is to let the value GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Global Ports Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Global Ports Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "GlobalPortsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/GlobalPortsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_0\",\r\n    \"description\": \"Allow Inbound By Default\",\r\n    \"name\": \"Allow Inbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_1\",\r\n    \"description\": \"Block Inbound By Default\",\r\n    \"name\": \"Block Inbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is the action that the firewall does by default (and evaluates at the very end) on inbound connections. The allow action is represented by 0x00000000; 0x00000001 represents a block action. Default value is 1 [Block]. The merge law for this option is to let the value of the GroupPolicyRSoPStore.win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Default Inbound Action for Domain Profile",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Inbound Action",
          "Firewall"
        ],
        "Name": "DefaultInboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DefaultInboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_false\",\r\n    \"description\": \"FALSE\",\r\n    \"name\": \"FALSE\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true\",\r\n    \"description\": \"TRUE\",\r\n    \"name\": \"TRUE\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. This option is ignored if DisableStealthMode is on. Otherwise, when this option is true, the firewall\u0027s stealth mode rules MUST NOT prevent the host computer from responding to unsolicited network traffic if that traffic is secured by IPsec.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used. For schema versions 0x0200, 0x0201, and 0x020A, this value is invalid and MUST NOT be used.",
        "DisplayName": "Disable Stealth Mode Ipsec Secured Packet Exemption",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode Ipsec Secured Packet Exemption",
          "Firewall"
        ],
        "Name": "DisableStealthModeIpsecSecuredPacketExemption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DisableStealthModeIpsecSecuredPacketExemption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_false\",\r\n    \"description\": \"AllowLocalPolicyMerge Off\",\r\n    \"name\": \"AllowLocalPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true\",\r\n    \"description\": \"AllowLocalPolicyMerge On\",\r\n    \"name\": \"AllowLocalPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, firewall rules from the local store are ignored and not enforced.  The merge law for this option is to always use the value of the GroupPolicyRSoPStore. This value is valid for all schema versions.",
        "DisplayName": "Allow Local Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/AllowLocalPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_false\",\r\n    \"description\": \"Disable Logging Of Successful Connections\",\r\n    \"name\": \"Disable Logging Of Successful Connections\",\r\n    \"displayName\": \"Disable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_true\",\r\n    \"description\": \"Enable Logging Of Successful Connections\",\r\n    \"name\": \"Enable Logging Of Successful Connections\",\r\n    \"displayName\": \"Enable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all successful inbound connections. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Success Connections",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Success Connections",
          "Firewall"
        ],
        "Name": "EnableLogSuccessConnections",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/EnableLogSuccessConnections",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_false\",\r\n    \"description\": \"Disable Firewall\",\r\n    \"name\": \"Disable Firewall\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n    \"description\": \"Enable Firewall\",\r\n    \"name\": \"Enable Firewall\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_logfilepath\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n        \"required\": false\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch for the firewall and advanced security enforcement. If this value is false, the server MUST NOT block any network traffic, regardless of other policy settings.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Enable Domain Network Firewall",
        "HelpText": " ",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "EnableFirewall",
          "Firewall",
          "Domain"
        ],
        "Name": "EnableFirewall",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/EnableFirewall",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_false\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, connection security rules from the local store are ignored and not enforced, regardless of the schema version and connection security rule version.   The merge law for this option is to always use the value of the GroupPolicyRSoPStore.",
        "DisplayName": "Allow Local Ipsec Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Ipsec Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalIpsecPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/AllowLocalIpsecPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value is a string that represents a file path to the log where the firewall logs dropped packets and successful connections. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log File Path",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_logfilepath",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log File Path",
          "Firewall"
        ],
        "Name": "LogFilePath",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/LogFilePath",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false\",\r\n    \"description\": \"Use Stealth Mode\",\r\n    \"name\": \"Use Stealth Mode\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_true\",\r\n    \"description\": \"Disable Stealth Mode\",\r\n    \"name\": \"Disable Stealth Mode\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. When this option is false, the server operates in stealth mode. The firewall rules used to enforce stealth mode are implementation-specific. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Stealth Mode",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode",
          "Firewall"
        ],
        "Name": "DisableStealthMode",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DisableStealthMode",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_false\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, authorized application firewall rules in the local store are ignored and not enforced.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Auth Apps Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Auth Apps Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "AuthAppsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/AuthAppsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_false\",\r\n    \"description\": \"Disable Logging Of Dropped Packets\",\r\n    \"name\": \"Disable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Disable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_true\",\r\n    \"description\": \"Enable Logging Of Dropped Packets\",\r\n    \"name\": \"Enable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Enable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all the dropped packets. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Dropped Packets",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Dropped Packets",
          "Firewall"
        ],
        "Name": "EnableLogDroppedPackets",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/EnableLogDroppedPackets",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_false\",\r\n    \"description\": \"Shielding Off\",\r\n    \"name\": \"Shielding Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_true\",\r\n    \"description\": \"Shielding On\",\r\n    \"name\": \"Shielding On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on and EnableFirewall is on, the server MUST block all incoming traffic regardless of other policy settings.  The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Shielded",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_shielded",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Shielded",
          "Firewall"
        ],
        "Name": "Shielded",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/Shielded",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_0\",\r\n    \"description\": \"Allow Outbound By Default\",\r\n    \"name\": \"Allow Outbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_1\",\r\n    \"description\": \"Block Outbound By Default\",\r\n    \"name\": \"Block Outbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is the action that the firewall does by default (and evaluates at the very end) on outbound connections. The allow action is represented by 0x00000000; 0x00000001 represents a block action. Default value is 0 [Allow]. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Default Outbound Action",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Outbound Action",
          "Firewall"
        ],
        "Name": "DefaultOutboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DefaultOutboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_false\",\r\n    \"description\": \"Firewall May Display Notification\",\r\n    \"name\": \"Firewall May Display Notification\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_true\",\r\n    \"description\": \"Firewall Must Not Display Notification\",\r\n    \"name\": \"Firewall Must Not Display Notification\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, the firewall MAY display a notification to the user when an application is blocked from listening on a port. If this value is on, the firewall MUST NOT display such a notification.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Inbound Notifications",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Inbound Notifications",
          "Firewall"
        ],
        "Name": "DisableInboundNotifications",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/DisableInboundNotifications",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value specifies the size, in kilobytes, of the log file where dropped packets and successful connections are logged. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log Max File Size",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log Max File Size",
          "Firewall"
        ],
        "Name": "LogMaxFileSize",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/DomainProfile/LogMaxFileSize",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "7714c373-a19a-4b64-ba6d-2e9db04a7684"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "1",
    "SettingDefinitions": [
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_false\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, connection security rules from the local store are ignored and not enforced, regardless of the schema version and connection security rule version.   The merge law for this option is to always use the value of the GroupPolicyRSoPStore.",
        "DisplayName": "Allow Local Ipsec Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Ipsec Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalIpsecPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/AllowLocalIpsecPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_false\",\r\n    \"description\": \"FALSE\",\r\n    \"name\": \"FALSE\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true\",\r\n    \"description\": \"TRUE\",\r\n    \"name\": \"TRUE\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. This option is ignored if DisableStealthMode is on. Otherwise, when this option is true, the firewall\u0027s stealth mode rules MUST NOT prevent the host computer from responding to unsolicited network traffic if that traffic is secured by IPsec.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used. For schema versions 0x0200, 0x0201, and 0x020A, this value is invalid and MUST NOT be used.",
        "DisplayName": "Disable Stealth Mode Ipsec Secured Packet Exemption",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode Ipsec Secured Packet Exemption",
          "Firewall"
        ],
        "Name": "DisableStealthModeIpsecSecuredPacketExemption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DisableStealthModeIpsecSecuredPacketExemption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_false\",\r\n    \"description\": \"Firewall May Display Notification\",\r\n    \"name\": \"Firewall May Display Notification\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true\",\r\n    \"description\": \"Firewall Must Not Display Notification\",\r\n    \"name\": \"Firewall Must Not Display Notification\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, the firewall MAY display a notification to the user when an application is blocked from listening on a port. If this value is on, the firewall MUST NOT display such a notification.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Inbound Notifications",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Inbound Notifications",
          "Firewall"
        ],
        "Name": "DisableInboundNotifications",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DisableInboundNotifications",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_false\",\r\n    \"description\": \"Shielding Off\",\r\n    \"name\": \"Shielding Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_true\",\r\n    \"description\": \"Shielding On\",\r\n    \"name\": \"Shielding On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on and EnableFirewall is on, the server MUST block all incoming traffic regardless of other policy settings.  The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Shielded",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_shielded",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Shielded",
          "Firewall"
        ],
        "Name": "Shielded",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/Shielded",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_false\",\r\n    \"description\": \"AllowLocalPolicyMerge Off\",\r\n    \"name\": \"AllowLocalPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true\",\r\n    \"description\": \"AllowLocalPolicyMerge On\",\r\n    \"name\": \"AllowLocalPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, firewall rules from the local store are ignored and not enforced.  The merge law for this option is to always use the value of the GroupPolicyRSoPStore. This value is valid for all schema versions.",
        "DisplayName": "Allow Local Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/AllowLocalPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0\",\r\n    \"description\": \"Allow Outbound By Default\",\r\n    \"name\": \"Allow Outbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_1\",\r\n    \"description\": \"Block Outbound By Default\",\r\n    \"name\": \"Block Outbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is the action that the firewall does by default (and evaluates at the very end) on outbound connections. The allow action is represented by 0x00000000; 0x00000001 represents a block action. Default value is 0 [Allow]. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Default Outbound Action",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Outbound Action",
          "Firewall"
        ],
        "Name": "DefaultOutboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DefaultOutboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_false\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, authorized application firewall rules in the local store are ignored and not enforced.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Auth Apps Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Auth Apps Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "AuthAppsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/AuthAppsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_false\",\r\n    \"description\": \"Disable Firewall\",\r\n    \"name\": \"Disable Firewall\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n    \"description\": \"Enable Firewall\",\r\n    \"name\": \"Enable Firewall\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_logfilepath\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n        \"required\": false\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch for the firewall and advanced security enforcement. If this value is false, the server MUST NOT block any network traffic, regardless of other policy settings.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Enable Private Network Firewall",
        "HelpText": " ",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "EnableFirewall",
          "Firewall"
        ],
        "Name": "EnableFirewall",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/EnableFirewall",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_false\",\r\n    \"description\": \"Disable Logging Of Ignored Rules\",\r\n    \"name\": \"Disable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Disable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_true\",\r\n    \"description\": \"Enable Logging Of Ignored Rules\",\r\n    \"name\": \"Enable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Enable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. The server MAY use this value in an implementation-specific way to control logging of events if a rule is not enforced for any reason. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Ignored Rules",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Ignored Rules",
          "Firewall"
        ],
        "Name": "EnableLogIgnoredRules",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/EnableLogIgnoredRules",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value specifies the size, in kilobytes, of the log file where dropped packets and successful connections are logged. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log Max File Size",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log Max File Size",
          "Firewall"
        ],
        "Name": "LogMaxFileSize",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/LogMaxFileSize",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_0\",\r\n    \"description\": \"Allow Inbound By Default\",\r\n    \"name\": \"Allow Inbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1\",\r\n    \"description\": \"Block Inbound By Default\",\r\n    \"name\": \"Block Inbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Specifies how to filter inbound traffic. The acceptable values for this parameter are: NotConfigured, Allow, or Block.",
        "DisplayName": "Default Inbound Action for Private Profile",
        "HelpText": " ",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Inbound Action",
          "Firewall"
        ],
        "Name": "DefaultInboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DefaultInboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false\",\r\n    \"description\": \"Unicast Responses Not Blocked\",\r\n    \"name\": \"Unicast Responses Not Blocked\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_true\",\r\n    \"description\": \"Unicast Responses Blocked\",\r\n    \"name\": \"Unicast Responses Blocked\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If it is true, unicast responses to multicast broadcast traffic is blocked.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Unicast Responses To Multicast Broadcast",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Unicast Responses To Multicast Broadcast",
          "Firewall"
        ],
        "Name": "DisableUnicastResponsesToMulticastBroadcast",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DisableUnicastResponsesToMulticastBroadcast",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value is a string that represents a file path to the log where the firewall logs dropped packets and successful connections. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log File Path",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_logfilepath",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log File Path",
          "Firewall"
        ],
        "Name": "LogFilePath",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/LogFilePath",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false\",\r\n    \"description\": \"Use Stealth Mode\",\r\n    \"name\": \"Use Stealth Mode\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_true\",\r\n    \"description\": \"Disable Stealth Mode\",\r\n    \"name\": \"Disable Stealth Mode\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. When this option is false, the server operates in stealth mode. The firewall rules used to enforce stealth mode are implementation-specific. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Stealth Mode",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode",
          "Firewall"
        ],
        "Name": "DisableStealthMode",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/DisableStealthMode",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_false\",\r\n    \"description\": \"Disable Logging Of Successful Connections\",\r\n    \"name\": \"Disable Logging Of Successful Connections\",\r\n    \"displayName\": \"Disable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_true\",\r\n    \"description\": \"Enable Logging Of Successful Connections\",\r\n    \"name\": \"Enable Logging Of Successful Connections\",\r\n    \"displayName\": \"Enable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all successful inbound connections. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Success Connections",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Success Connections",
          "Firewall"
        ],
        "Name": "EnableLogSuccessConnections",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/EnableLogSuccessConnections",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_false\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, global port firewall rules in the local store are ignored and not enforced. The setting only has meaning if it is set or enumerated in the Group Policy store or if it is enumerated from the GroupPolicyRSoPStore.  The merge law for this option is to let the value GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Global Ports Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Global Ports Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "GlobalPortsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/GlobalPortsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_false\",\r\n    \"description\": \"Disable Logging Of Dropped Packets\",\r\n    \"name\": \"Disable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Disable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_true\",\r\n    \"description\": \"Enable Logging Of Dropped Packets\",\r\n    \"name\": \"Enable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Enable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all the dropped packets. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Dropped Packets",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Dropped Packets",
          "Firewall"
        ],
        "Name": "EnableLogDroppedPackets",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PrivateProfile/EnableLogDroppedPackets",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "1c14f914-69bb-49f8-af5b-e29173a6ee95"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "2",
    "SettingDefinitions": [
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0\",\r\n    \"description\": \"Allow Outbound By Default\",\r\n    \"name\": \"Allow Outbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_1\",\r\n    \"description\": \"Block Outbound By Default\",\r\n    \"name\": \"Block Outbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is the action that the firewall does by default (and evaluates at the very end) on outbound connections. The allow action is represented by 0x00000000; 0x00000001 represents a block action. Default value is 0 [Allow]. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Default Outbound Action",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Outbound Action",
          "Firewall"
        ],
        "Name": "DefaultOutboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DefaultOutboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_false\",\r\n    \"description\": \"Firewall May Display Notification\",\r\n    \"name\": \"Firewall May Display Notification\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true\",\r\n    \"description\": \"Firewall Must Not Display Notification\",\r\n    \"name\": \"Firewall Must Not Display Notification\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, the firewall MAY display a notification to the user when an application is blocked from listening on a port. If this value is on, the firewall MUST NOT display such a notification.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Inbound Notifications",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Inbound Notifications",
          "Firewall"
        ],
        "Name": "DisableInboundNotifications",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DisableInboundNotifications",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_false\",\r\n    \"description\": \"FALSE\",\r\n    \"name\": \"FALSE\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true\",\r\n    \"description\": \"TRUE\",\r\n    \"name\": \"TRUE\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. This option is ignored if DisableStealthMode is on. Otherwise, when this option is true, the firewall\u0027s stealth mode rules MUST NOT prevent the host computer from responding to unsolicited network traffic if that traffic is secured by IPsec.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used. For schema versions 0x0200, 0x0201, and 0x020A, this value is invalid and MUST NOT be used.",
        "DisplayName": "Disable Stealth Mode Ipsec Secured Packet Exemption",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode Ipsec Secured Packet Exemption",
          "Firewall"
        ],
        "Name": "DisableStealthModeIpsecSecuredPacketExemption",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DisableStealthModeIpsecSecuredPacketExemption",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_false\",\r\n    \"description\": \"Shielding Off\",\r\n    \"name\": \"Shielding Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_true\",\r\n    \"description\": \"Shielding On\",\r\n    \"name\": \"Shielding On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on and EnableFirewall is on, the server MUST block all incoming traffic regardless of other policy settings.  The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Shielded",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_shielded",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Shielded",
          "Firewall"
        ],
        "Name": "Shielded",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/Shielded",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_false\",\r\n    \"description\": \"AllowLocalPolicyMerge Off\",\r\n    \"name\": \"AllowLocalPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true\",\r\n    \"description\": \"AllowLocalPolicyMerge On\",\r\n    \"name\": \"AllowLocalPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, firewall rules from the local store are ignored and not enforced.  The merge law for this option is to always use the value of the GroupPolicyRSoPStore. This value is valid for all schema versions.",
        "DisplayName": "Allow Local Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/AllowLocalPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_false\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true\",\r\n    \"description\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"name\": \"AuthAppsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, authorized application firewall rules in the local store are ignored and not enforced.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Auth Apps Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Auth Apps Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "AuthAppsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/AuthAppsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value is a string that represents a file path to the log where the firewall logs dropped packets and successful connections. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log File Path",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_logfilepath",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log File Path",
          "Firewall"
        ],
        "Name": "LogFilePath",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/LogFilePath",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_0\",\r\n    \"description\": \"Allow Inbound By Default\",\r\n    \"name\": \"Allow Inbound By Default\",\r\n    \"displayName\": \"Allow\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1\",\r\n    \"description\": \"Block Inbound By Default\",\r\n    \"name\": \"Block Inbound By Default\",\r\n    \"displayName\": \"Block\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Specifies how to filter inbound traffic. The acceptable values for this parameter are: NotConfigured, Allow, or Block.",
        "DisplayName": "Default Inbound Action for Public Profile",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Default Inbound Action",
          "Firewall"
        ],
        "Name": "DefaultInboundAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DefaultInboundAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false\",\r\n    \"description\": \"Unicast Responses Not Blocked\",\r\n    \"name\": \"Unicast Responses Not Blocked\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_true\",\r\n    \"description\": \"Unicast Responses Blocked\",\r\n    \"name\": \"Unicast Responses Blocked\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If it is true, unicast responses to multicast broadcast traffic is blocked.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Unicast Responses To Multicast Broadcast",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Unicast Responses To Multicast Broadcast",
          "Firewall"
        ],
        "Name": "DisableUnicastResponsesToMulticastBroadcast",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DisableUnicastResponsesToMulticastBroadcast",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_false\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true\",\r\n    \"description\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"name\": \"GlobalPortsAllowUserPrefMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is false, global port firewall rules in the local store are ignored and not enforced. The setting only has meaning if it is set or enumerated in the Group Policy store or if it is enumerated from the GroupPolicyRSoPStore.  The merge law for this option is to let the value GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Global Ports Allow User Pref Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Global Ports Allow User Pref Merge",
          "Firewall"
        ],
        "Name": "GlobalPortsAllowUserPrefMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/GlobalPortsAllowUserPrefMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_false\",\r\n    \"description\": \"Disable Logging Of Successful Connections\",\r\n    \"name\": \"Disable Logging Of Successful Connections\",\r\n    \"displayName\": \"Disable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_true\",\r\n    \"description\": \"Enable Logging Of Successful Connections\",\r\n    \"name\": \"Enable Logging Of Successful Connections\",\r\n    \"displayName\": \"Enable Logging Of Successful Connections\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all successful inbound connections. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Success Connections",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Success Connections",
          "Firewall"
        ],
        "Name": "EnableLogSuccessConnections",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/EnableLogSuccessConnections",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_false\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge Off\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true\",\r\n    \"description\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"name\": \"AllowLocalIpsecPolicyMerge On\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. If this value is false, connection security rules from the local store are ignored and not enforced, regardless of the schema version and connection security rule version.   The merge law for this option is to always use the value of the GroupPolicyRSoPStore.",
        "DisplayName": "Allow Local Ipsec Policy Merge",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Allow Local Ipsec Policy Merge",
          "Firewall"
        ],
        "Name": "AllowLocalIpsecPolicyMerge",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/AllowLocalIpsecPolicyMerge",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_false\",\r\n    \"description\": \"Disable Firewall\",\r\n    \"name\": \"Disable Firewall\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n    \"description\": \"Enable Firewall\",\r\n    \"name\": \"Enable Firewall\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_logfilepath\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n        \"required\": false\r\n      },\r\n      {\r\n        \"dependedOnBy\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n        \"required\": false\r\n      }\r\n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch for the firewall and advanced security enforcement. If this value is false, the server MUST NOT block any network traffic, regardless of other policy settings.  The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Enable Public Network Firewall",
        "HelpText": " ",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "EnableFirewall",
          "Public",
          "Firewall"
        ],
        "Name": "EnableFirewall",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/EnableFirewall",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_false\",\r\n    \"description\": \"Disable Logging Of Dropped Packets\",\r\n    \"name\": \"Disable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Disable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_true\",\r\n    \"description\": \"Enable Logging Of Dropped Packets\",\r\n    \"name\": \"Enable Logging Of Dropped Packets\",\r\n    \"displayName\": \"Enable Logging Of Dropped Packets\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. If this value is on, the firewall logs all the dropped packets. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Dropped Packets",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Dropped Packets",
          "Firewall"
        ],
        "Name": "EnableLogDroppedPackets",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/EnableLogDroppedPackets",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_false\",\r\n    \"description\": \"Disable Logging Of Ignored Rules\",\r\n    \"name\": \"Disable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Disable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_true\",\r\n    \"description\": \"Enable Logging Of Ignored Rules\",\r\n    \"name\": \"Enable Logging Of Ignored Rules\",\r\n    \"displayName\": \"Enable Logging Of Ignored Rules\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is used as an on/off switch. The server MAY use this value in an implementation-specific way to control logging of events if a rule is not enforced for any reason. The merge law for this option is to let \"on\" values win.",
        "DisplayName": "Enable Log Ignored Rules",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Enable Log Ignored Rules",
          "Firewall"
        ],
        "Name": "EnableLogIgnoredRules",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/EnableLogIgnoredRules",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "",
        "Description": "This value specifies the size, in kilobytes, of the log file where dropped packets and successful connections are logged. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured, otherwise the MdmStore value wins if it is configured, otherwise the local store value is used.",
        "DisplayName": "Log Max File Size",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/Firewall-csp/"
        ],
        "Keywords": [
          "Log Max File Size",
          "Firewall"
        ],
        "Name": "LogMaxFileSize",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/LogMaxFileSize",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Vendor/MSFT/Firewall",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false\",\r\n    \"description\": \"Use Stealth Mode\",\r\n    \"name\": \"Use Stealth Mode\",\r\n    \"displayName\": \"False\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"false\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_true\",\r\n    \"description\": \"Disable Stealth Mode\",\r\n    \"name\": \"Disable Stealth Mode\",\r\n    \"displayName\": \"True\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"true\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n        \"parentSettingId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "This value is an on/off switch. When this option is false, the server operates in stealth mode. The firewall rules used to enforce stealth mode are implementation-specific. The merge law for this option is to let the value of the GroupPolicyRSoPStore win if it is configured; otherwise, the local store value is used.",
        "DisplayName": "Disable Stealth Mode",
        "HelpText": "",
        "Id": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
        "InfoUrls": [
          "https://docs.microsoft.com/en-us/windows/client-management/mdm/firewall-csp"
        ],
        "Keywords": [
          "Disable Stealth Mode",
          "Firewall"
        ],
        "Name": "DisableStealthMode",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 1
        },
        "OffsetUri": "/MdmStore/PublicProfile/DisableStealthMode",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "e2714734-708e-4286-8ae9-d56821e306a3"
      }
    },
    "AdditionalProperties": {
      
    }
  }
]
