[
  {
    "Id": "0",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_clean\",\r\n    \"name\": \"Clean\",\r\n    \"displayName\": \"Clean. Service tries to recover files and try to disinfect.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_quarantine\",\r\n    \"name\": \"Quarantine\",\r\n    \"displayName\": \"Quarantine. Moves files to quarantine.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_remove\",\r\n    \"name\": \"Remove\",\r\n    \"displayName\": \"Remove. Removes files from system.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_allow\",\r\n    \"name\": \"Allow\",\r\n    \"displayName\": \"Allow. Allows file/does none of the above actions.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_userdefined\",\r\n    \"name\": \"UserDefined\",\r\n    \"displayName\": \"User defined. Requires user to make a decision on which action to take.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=8\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_block\",\r\n    \"name\": \"Block\",\r\n    \"displayName\": \"Block. Blocks file execution.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"4=10\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Remediation action for High severity threats",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "Threat Severity Default Action",
          "Defender"
        ],
        "Name": "HighSeverityThreatDefaultAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "",
        "Description": "",
        "DisplayName": "Threat Severity Default Action",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "Threat Severity Default Action",
          "Defender"
        ],
        "Name": "ThreatSeverityDefaultAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_clean\",\r\n    \"name\": \"Clean\",\r\n    \"displayName\": \"Clean. Service tries to recover files and try to disinfect.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_quarantine\",\r\n    \"name\": \"Quarantine\",\r\n    \"displayName\": \"Quarantine. Moves files to quarantine.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_remove\",\r\n    \"name\": \"Remove\",\r\n    \"displayName\": \"Remove. Removes files from system.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_allow\",\r\n    \"name\": \"Allow\",\r\n    \"displayName\": \"Allow. Allows file/does none of the above actions.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_userdefined\",\r\n    \"name\": \"UserDefined\",\r\n    \"displayName\": \"User defined. Requires user to make a decision on which action to take.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=8\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_block\",\r\n    \"name\": \"Block\",\r\n    \"displayName\": \"Block. Blocks file execution.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"5=10\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Remediation action for Severe threats",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "Threat Severity Default Action",
          "Defender"
        ],
        "Name": "SevereThreatDefaultAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_clean\",\r\n    \"name\": \"Clean\",\r\n    \"displayName\": \"Clean. Service tries to recover files and try to disinfect.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_quarantine\",\r\n    \"name\": \"Quarantine\",\r\n    \"displayName\": \"Quarantine. Moves files to quarantine.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_remove\",\r\n    \"name\": \"Remove\",\r\n    \"displayName\": \"Remove. Removes files from system.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_allow\",\r\n    \"name\": \"Allow\",\r\n    \"displayName\": \"Allow. Allows file/does none of the above actions.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_userdefined\",\r\n    \"name\": \"UserDefined\",\r\n    \"displayName\": \"User defined. Requires user to make a decision on which action to take.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=8\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_block\",\r\n    \"name\": \"Block\",\r\n    \"displayName\": \"Block. Blocks file execution.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"1=10\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Remediation action for Low severity threats",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "Threat Severity Default Action",
          "Defender"
        ],
        "Name": "LowSeverityThreatDefaultAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      },
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_clean\",\r\n    \"name\": \"Clean\",\r\n    \"displayName\": \"Clean. Service tries to recover files and try to disinfect.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=1\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_quarantine\",\r\n    \"name\": \"Quarantine\",\r\n    \"displayName\": \"Quarantine. Moves files to quarantine.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=2\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_remove\",\r\n    \"name\": \"Remove\",\r\n    \"displayName\": \"Remove. Removes files from system.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=3\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_allow\",\r\n    \"name\": \"Allow\",\r\n    \"displayName\": \"Allow. Allows file/does none of the above actions.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=6\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_userdefined\",\r\n    \"name\": \"UserDefined\",\r\n    \"displayName\": \"User defined. Requires user to make a decision on which action to take.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=8\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_block\",\r\n    \"name\": \"Block\",\r\n    \"displayName\": \"Block. Blocks file execution.\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationStringSettingValue\",\r\n      \"value\": \"2=10\"\r\n    },\r\n    \"dependentOn\": [\r\n      {\r\n        \"dependentOn\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\",\r\n        \"parentSettingId\": \"device_vendor_msft_policy_config_defender_threatseveritydefaultaction\"\r\n      }\r\n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "",
        "DisplayName": "Remediation action for Moderate severity threats",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats",
        "InfoUrls": [
          
        ],
        "Keywords": [
          "Threat Severity Default Action",
          "Defender"
        ],
        "Name": "ModerateSeverityThreatDefaultAction",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ThreatSeverityDefaultAction",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
      }
    },
    "AdditionalProperties": {
      
    }
  },
  {
    "Id": "1",
    "SettingDefinitions": [
      {
        "AccessTypes": "add,delete,get,replace",
        "Applicability": {
          "Description": null,
          "DeviceMode": {
            
          },
          "Platform": {
            
          },
          "Technologies": {
            
          }
        },
        "BaseUri": "./Device/Vendor/MSFT/Policy",
        "CategoryId": "[\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_0\",\r\n    \"description\": \"Every day\",\r\n    \"name\": \"Every day\",\r\n    \"displayName\": \"Every day\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 0\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_1\",\r\n    \"description\": \"Sunday\",\r\n    \"name\": \"Sunday\",\r\n    \"displayName\": \"Sunday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 1\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_2\",\r\n    \"description\": \"Monday\",\r\n    \"name\": \"Monday\",\r\n    \"displayName\": \"Monday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 2\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_3\",\r\n    \"description\": \"Tuesday\",\r\n    \"name\": \"Tuesday\",\r\n    \"displayName\": \"Tuesday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 3\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_4\",\r\n    \"description\": \"Wednesday\",\r\n    \"name\": \"Wednesday\",\r\n    \"displayName\": \"Wednesday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 4\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_5\",\r\n    \"description\": \"Thursday\",\r\n    \"name\": \"Thursday\",\r\n    \"displayName\": \"Thursday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 5\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_6\",\r\n    \"description\": \"Friday\",\r\n    \"name\": \"Friday\",\r\n    \"displayName\": \"Friday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 6\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_7\",\r\n    \"description\": \"Saturday\",\r\n    \"name\": \"Saturday\",\r\n    \"displayName\": \"Saturday\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 7\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  },\r\n  {\r\n    \"itemId\": \"device_vendor_msft_policy_config_defender_schedulescanday_8\",\r\n    \"description\": \"No scheduled scan\",\r\n    \"name\": \"No scheduled scan\",\r\n    \"displayName\": \"No scheduled scan\",\r\n    \"optionValue\": {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n      \"value\": 8\r\n    },\r\n    \"dependentOn\": [\r\n      \n    ],\r\n    \"dependedOnBy\": [\r\n      \n    ]\r\n  }\r\n]",
        "Description": "Selects the day that the Windows Defender scan should run. Note The scan type will depends on what scan type is selected in the Defender/ScanParameter setting.",
        "DisplayName": "Schedule Scan Day",
        "HelpText": "",
        "Id": "device_vendor_msft_policy_config_defender_schedulescanday",
        "InfoUrls": [
          "https://docs.microsoft.com/windows/client-management/mdm/policy-csp-Defender#defender-schedulescanday"
        ],
        "Keywords": [
          "Schedule Scan Day",
          "Defender"
        ],
        "Name": "ScheduleScanDay",
        "Occurrence": {
          "MaxDeviceOccurrence": 1,
          "MinDeviceOccurrence": 0
        },
        "OffsetUri": "/Config/Defender/ScheduleScanDay",
        "ReferredSettingInformationList": [
          
        ],
        "RootDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
        "SettingUsage": {
          
        },
        "UxBehavior": {
          
        },
        "Version": "638609848155120837",
        "Visibility": {
          
        }
      }
    ],
    "SettingInstance": {
      "SettingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
      "SettingInstanceTemplateReference": {
        "SettingInstanceTemplateId": "087d3362-7e78-4983-96bc-1f4ea183f0e4"
      }
    },
    "AdditionalProperties": {
      
    }
  }
]
